src/test/load/artillery/system/update-config/storage/group-8.yml
config:
  target: http://192.168.0.166:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.166:4044/nomad/config/storage?storageMode=SAFE"
      - post:
          url: "http://192.168.0.166:4039/nomad/config/storage?storageMode=SAFE"
      - post:
          url: "http://192.168.0.166:4005/nomad/config/storage?storageMode=SAFE"
      - post:
          url: "http://192.168.0.166:4025/nomad/config/storage?storageMode=SAFE"